Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C1290NCPDT.svd
        <register>
          <name>PRGPIO</name>
          <description>General-Purpose Input/Output Peripheral Ready</description>
          <addressOffset>0x00000A08</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRGPIO_R0</name>
              <description>GPIO Port A Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R1</name>
              <description>GPIO Port B Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R2</name>
              <description>GPIO Port C Peripheral Ready</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R3</name>
              <description>GPIO Port D Peripheral Ready</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R4</name>
              <description>GPIO Port E Peripheral Ready</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R5</name>
              <description>GPIO Port F Peripheral Ready</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R6</name>
              <description>GPIO Port G Peripheral Ready</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R7</name>
              <description>GPIO Port H Peripheral Ready</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R8</name>
              <description>GPIO Port J Peripheral Ready</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R9</name>
              <description>GPIO Port K Peripheral Ready</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R10</name>
              <description>GPIO Port L Peripheral Ready</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R11</name>
              <description>GPIO Port M Peripheral Ready</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R12</name>
              <description>GPIO Port N Peripheral Ready</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R13</name>
              <description>GPIO Port P Peripheral Ready</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R14</name>
              <description>GPIO Port Q Peripheral Ready</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRDMA</name>
          <description>Micro Direct Memory Access Peripheral Ready</description>
          <addressOffset>0x00000A0C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRDMA_R0</name>
              <description>uDMA Module Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PREPI</name>
          <description>EPI Peripheral Ready</description>
          <addressOffset>0x00000A10</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PREPI_R0</name>
              <description>EPI Module Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRHIB</name>
          <description>Hibernation Peripheral Ready</description>
          <addressOffset>0x00000A14</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRHIB_R0</name>
              <description>Hibernation Module Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Peripheral Ready</description>
          <addressOffset>0x00000A18</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRUART_R0</name>
              <description>UART Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R1</name>
              <description>UART Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R2</name>
              <description>UART Module 2 Peripheral Ready</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R3</name>
              <description>UART Module 3 Peripheral Ready</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R4</name>
              <description>UART Module 4 Peripheral Ready</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R5</name>
              <description>UART Module 5 Peripheral Ready</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R6</name>
              <description>UART Module 6 Peripheral Ready</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R7</name>
              <description>UART Module 7 Peripheral Ready</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSSI</name>
          <description>Synchronous Serial Interface Peripheral Ready</description>
          <addressOffset>0x00000A1C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRSSI_R0</name>
              <description>SSI Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRSSI_R1</name>
              <description>SSI Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRSSI_R2</name>
              <description>SSI Module 2 Peripheral Ready</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRSSI_R3</name>
              <description>SSI Module 3 Peripheral Ready</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI2C</name>
          <description>Inter-Integrated Circuit Peripheral Ready</description>
          <addressOffset>0x00000A20</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRI2C_R0</name>
              <description>I2C Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R1</name>
              <description>I2C Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R2</name>
              <description>I2C Module 2 Peripheral Ready</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R3</name>
              <description>I2C Module 3 Peripheral Ready</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R4</name>
              <description>I2C Module 4 Peripheral Ready</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R5</name>
              <description>I2C Module 5 Peripheral Ready</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R6</name>
              <description>I2C Module 6 Peripheral Ready</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R7</name>
              <description>I2C Module 7 Peripheral Ready</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R8</name>
              <description>I2C Module 8 Peripheral Ready</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R9</name>
              <description>I2C Module 9 Peripheral Ready</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRUSB</name>
          <description>Universal Serial Bus Peripheral Ready</description>
          <addressOffset>0x00000A28</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRUSB_R0</name>
              <description>USB Module Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRCAN</name>
          <description>Controller Area Network Peripheral Ready</description>
          <addressOffset>0x00000A34</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRCAN_R0</name>
              <description>CAN Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRCAN_R1</name>
              <description>CAN Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRADC</name>
          <description>Analog-to-Digital Converter Peripheral Ready</description>
          <addressOffset>0x00000A38</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRADC_R0</name>
              <description>ADC Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRADC_R1</name>
              <description>ADC Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRACMP</name>
          <description>Analog Comparator Peripheral Ready</description>
          <addressOffset>0x00000A3C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRACMP_R0</name>
              <description>Analog Comparator Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRPWM</name>
          <description>Pulse Width Modulator Peripheral Ready</description>
          <addressOffset>0x00000A40</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRPWM_R0</name>
              <description>PWM Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRQEI</name>
          <description>Quadrature Encoder Interface Peripheral Ready</description>
          <addressOffset>0x00000A44</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRQEI_R0</name>
              <description>QEI Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PREEPROM</name>
          <description>EEPROM Peripheral Ready</description>
          <addressOffset>0x00000A58</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PREEPROM_R0</name>
              <description>EEPROM Module Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRCCM</name>
          <description>CRC and Cryptographic Modules Peripheral Ready</description>
          <addressOffset>0x00000A74</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRCCM_R0</name>
              <description>CRC and Cryptographic Modules Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
